### Pandas DataFrame
#### [Documentation and practice](https://www.w3resource.com/python-exercises/pandas/index-dataframe.php)

In [127]:
import pandas as pd
import numpy as np

#### 14. Write a Pandas program to calculate the mean score for each different student in DataFrame

In [128]:
dataset = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
                          'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
                          'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}, 
                           index =['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [18]:
dataset.head(10)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [36]:
data_mean = dataset['score'].mean()

In [37]:
print(f"Mean score: {data_mean}")

Mean score: 13.5625

#### 15. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.

In [39]:
dataset_1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
                          'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
                          'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}, 
                           index =['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [75]:
dataset_1.loc['k'] = [1, 'Suresh', 'yes', 15.5]
dataset_1.loc['z'] = ['Biden','99.9','100','I do not know']

In [76]:
print(dataset_1)

        name   score attempts        qualify
a  Anastasia    12.5        1            yes
b       Dima     9.0        3             no
c  Katherine    16.5        2            yes
d      James     NaN        3             no
e      Emily     9.0        2             no
f    Michael    20.0        3            yes
g    Matthew    14.5        1            yes
h      Laura     NaN        1             no
i      Kevin     8.0        2             no
j      Jonas    19.0        1            yes
k          1  Suresh      yes           15.5
z      Biden    99.9      100  I do not know

In [77]:
del_k = dataset_1.drop('k')

In [78]:
del_z = del_k.drop('z')

In [79]:
print(f"Drop 'k & z': \n{del_z}")

Drop 'k & z':
        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James   NaN        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes

#### 16. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order

In [95]:
dataset.head(10)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [100]:
data_sort = dataset.sort_values(by = ['name', 'score'], ascending=[False, True])

In [109]:
data_sort.head(10)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
e      Emily    9.0         2      no
d      James    NaN         3      no
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes
i      Kevin    8.0         2      no
h      Laura    NaN         1      no
g    Matthew   14.5         1     yes
f    Michael   20.0         3     yes

In [131]:
data_sort_1 = dataset.sort_values(by = ['name'])

In [132]:
data_sort_1.head(10)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
e      Emily    9.0         2      no
d      James    NaN         3      no
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes
i      Kevin    8.0         2      no
h      Laura    NaN         1      no
g    Matthew   14.5         1     yes
f    Michael   20.0         3     yes

#### 17. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False

In [138]:
dataset_3 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
                          'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
                          'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}, 
                           index =['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [139]:
dataset_3['qualify'] = dataset_3['qualify'].map({'yes': True, 'no': False})

In [140]:
dataset_3.head(10)

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

#### 18.Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.

In [155]:
dataset_4 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
                          'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
                          'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}, 
                           index =['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [159]:
dataset_4['name'] = dataset_4['name'].replace('James', 'Suresh')

In [160]:
dataset_4.head(10)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

#### 19. Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [162]:
dataset_5 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
                          'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
                          'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}, 
                           index =['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [163]:
dataset_5.head(10)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [165]:
dataset_5 = dataset_5.drop(['attempts'],axis=1)

In [198]:
dataset_5.head(11)

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

#### 20. Write a Pandas program to insert a new column in existing DataFrame.

In [229]:
dataset_6 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
                          'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
                          'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}, 
                           index =['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [230]:
age = [0,1,2,3,4,5,6,7,8,9]

In [231]:
dataset_6['age'] = age

In [232]:
dataset_6.head(10)

        name  score  attempts qualify  age
a  Anastasia   12.5         1     yes    0
b       Dima    9.0         3      no    1
c  Katherine   16.5         2     yes    2
d      James    NaN         3      no    3
e      Emily    9.0         2      no    4
f    Michael   20.0         3     yes    5
g    Matthew   14.5         1     yes    6
h      Laura    NaN         1      no    7
i      Kevin    8.0         2      no    8
j      Jonas   19.0         1     yes    9

In [277]:
dataset_7 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
                          'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
                          'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}, 
                           index =['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [278]:
dataset_7.insert(4, "age",[0,1,2,3,4,5,6,7,8,9])

In [279]:
dataset_7.head(10)

        name  score  attempts qualify  age
a  Anastasia   12.5         1     yes    0
b       Dima    9.0         3      no    1
c  Katherine   16.5         2     yes    2
d      James    NaN         3      no    3
e      Emily    9.0         2      no    4
f    Michael   20.0         3     yes    5
g    Matthew   14.5         1     yes    6
h      Laura    NaN         1      no    7
i      Kevin    8.0         2      no    8
j      Jonas   19.0         1     yes    9

#### 21. Write a Pandas program to iterate over rows in a DataFrame

In [281]:
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}]

In [282]:
exam_data = pd.DataFrame(exam_data)

In [283]:
exam_data.head()

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5

In [290]:
for index, row in exam_data.iterrows():
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5

In [ ]:
name = "dima"

In [ ]:
dd

'DimA'

In [20]:
name.split('m')

['di', 'a']